var rooms = {

    applied: [
        {
            "square": "23.3",
            "name": "Серверна кімната лабораторії інформаційних технологій",
            "room": "081"
        },
        {
            "square": "87.9",
            "name": "Аудиторія",
            "room": "111"
        },
        {
            "square": "",
            "name": "Лабораторія інформаційних технологій",
            "room": "118а"
        },
        {
            "square": "18.6",
            "name": "Кафедра прикладної математики",
            "room": "259"
        },
        {
            "square": "49.7",
            "name": "Кафедра інформаційних систем",
            "room": "260"
        },
        {
            "square": "44.4",
            "name": "Навчальна комп’ютерна лабораторія кафедри обчислювальної математики",
            "room": "261"
        },
        {
            "square": "43.4",
            "name": "Кафедра обчислювальної математики",
            "room": "262"
        },
        {
            "square": "62",
            "name": "Кафедра програмування",
            "room": "263"
        },
        {
            "square": "17.4",
            "name": "Кафедра дискретного аналізу та інтелектуальних систем",
            "room": "264"
        },
        {
            "square": "47",
            "name": "Аудиторія",
            "room": "265"
        },
        {
            "square": "43",
            "name": "Аудиторія",
            "room": "266"
        },
        {
            "square": "42.1",
            "name": "Кафедра теорії оптимальних процесів",
            "room": "269"
        },
        {
            "square": "38.3",
            "name": "Лабораторія кафедри програмування",
            "room": "270"
        },
        {
            "square": "41.6",
            "name": "Лабораторія системного аналізу",
            "room": "272/273"
        },
        {
            "square": "68.6",
            "name": "Деканат",
            "room": "274"
        },
        {
            "square": "56.2",
            "name": "Кафедра прикладної математики",
            "room": "278"
        },
        {
            "square": "55.9",
            "name": "Кафедра дискретного аналізу та інтелектуальних систем",
            "room": "360"
        },
        {
            "square": "66.3",
            "name": "Кафедра математичного моделювання соціально-економічних процесів",
            "room": "361"
        },
        {
            "square": "35.4",
            "name": "Аудиторія",
            "room": "365"
        },
        {
            "square": "33",
            "name": "Аудиторія",
            "room": "366"
        },
        {
            "square": "48.5",
            "name": "Аудиторія",
            "room": "367"
        },
        {
            "square": "103.5",
            "name": "Аудиторія",
            "room": "439"
        }
    ],

    mehmat: [
        {
            "square": "12.6",
            "name": "Майстерня лабораторії механічних випробувань",
            "room": "042"
        },
        {
            "square": "148.2",
            "name": "Лабораторія механічних випробувань",
            "room": "043"
        },
        {
            "square": "30.4",
            "name": "Аудиторія",
            "room": "044"
        },
        {
            "square": "61.1",
            "name": "Аудиторія",
            "room": "045"
        },
        {
            "square": "57.9",
            "name": "Лабораторія комп’ютеризації навчального процесу",
            "room": "112"
        },
        {
            "square": "75.7",
            "name": "Лабораторія комп’ютеризації навчального процесу",
            "room": "113"
        },
        {
            "square": "19.7",
            "name": "Лабораторія кафедри диференційних рівнянь",
            "room": "144"
        },
        {
            "square": "22.6",
            "name": "Аудиторія",
            "room": "145"
        },
        {
            "square": "63.7",
            "name": "Аудиторія",
            "room": "146"
        },
        {
            "square": "13",
            "name": "Кабінет завідувача кафедри механіки",
            "room": "146а"
        },
        {
            "square": "3.3",
            "name": "Кабінет студентського самоврядування факультету",
            "room": "146б"
        },
        {
            "square": "26",
            "name": "Аудиторія",
            "room": "147"
        },
        {
            "square": "56.6",
            "name": "Кафедра механіки",
            "room": "148"
        },
        {
            "square": "20.6",
            "name": "Кафедра математичної економіки та економетрії",
            "room": "148а"
        },
        {
            "square": "23.4",
            "name": "Аудиторія",
            "room": "150"
        },
        {
            "square": "36.3",
            "name": "Лабораторія динамічного тензометрування",
            "room": "151"
        },
        {
            "square": "18.5",
            "name": "Лабораторія фотопружності",
            "room": "151а"
        },
        {
            "square": "78.6",
            "name": "Кафедра теоретичної та прикладної статистики",
            "room": "153"
        },
        {
            "square": "134.6",
            "name": "Аудиторія",
            "room": "216"
        },
        {
            "square": "23.5",
            "name": "Аудиторія",
            "room": "267"
        },
        {
            "square": "35",
            "name": "Кафедра диференційних рівнянь",
            "room": "267а"
        },
        {
            "square": "57.6",
            "name": "Деканат механіко-математичного факультету",
            "room": "268"
        },
        {
            "square": "46.9",
            "name": "Лабораторія статичного тензометрування",
            "room": "271"
        },
        {
            "square": "22",
            "name": "Кабінет наукової математичної літератури",
            "room": "275"
        },
        {
            "square": "27.1",
            "name": "Кабінет наукової математичної літератури",
            "room": "276"
        },
        {
            "square": "40.4",
            "name": "Кабінет наукової математичної літератури",
            "room": "277"
        },
        {
            "square": "12.2",
            "name": "Аудиторія",
            "room": "354"
        },
        {
            "square": "47.5",
            "name": "Кафедра математичної економіки та економетрії",
            "room": "354а"
        },
        {
            "square": "41",
            "name": "Аудиторія",
            "room": "368"
        },
        {
            "square": "34",
            "name": "Кафедра вищої математики",
            "room": "370"
        },
        {
            "square": "48.2",
            "name": "Аудиторія",
            "room": "372"
        },
        {
            "square": "44.7",
            "name": "Кафедра вищої математики",
            "room": "373"
        },
        {
            "square": "27.9",
            "name": "Кафедра геометрії  і топології",
            "room": "374"
        },
        {
            "square": "44.7",
            "name": "Кафедра алгебри і логіки",
            "room": "375"
        },
        {
            "square": "25.9",
            "name": "Кафедра математичного моделювання",
            "room": "376"
        },
        {
            "square": "66.5",
            "name": "Лабораторія кафедри математичного моделювання",
            "room": "376б"
        },
        {
            "square": "47.8",
            "name": "Аудиторія",
            "room": "377"
        },
        {
            "square": "47.8",
            "name": "Аудиторія",
            "room": "379"
        },
        {
            "square": "29",
            "name": "Кафедра теорії функцій і теорії ймовірностей",
            "room": "380"
        },
        {
            "square": "16",
            "name": "Редакція журналу «Математичні студії»",
            "room": "380а"
        },
        {
            "square": "25.1",
            "name": "Аудиторія",
            "room": "381"
        },
        {
            "square": "20",
            "name": "Аудиторія",
            "room": "382"
        },
        {
            "square": "39.4",
            "name": "Лабораторія кафедри математичного і функціонального аналізу",
            "room": "383"
        },
        {
            "square": "38.1",
            "name": "Підсобне приміщення лабораторії комп’ютеризації навчального процесу",
            "room": "439а"
        }
    ],

    inoz_mov: [
        {
            "square": "15.1",
            "name": "Аудиторія",
            "room": "401"
        },
        {
            "square": "18.8",
            "name": "Аудиторія",
            "room": "402"
        },
        {
            "square": "16.2",
            "name": "Аудиторія",
            "room": "403"
        },
        {
            "square": "53.8",
            "name": "Аудиторія",
            "room": "404"
        },
        {
            "square": "51.7",
            "name": "Конференційна зала",
            "room": "405"
        },
        {
            "square": "34.8",
            "name": "Аудиторія",
            "room": "406"
        },
        {
            "square": "21.6",
            "name": "Аудиторія",
            "room": "407"
        },
        {
            "square": "18",
            "name": "Аудиторія",
            "room": "407а"
        },
        {
            "square": "25.8",
            "name": "Аудиторія",
            "room": "408"
        },
        {
            "square": "18.6",
            "name": "Аудиторія",
            "room": "409"
        },
        {
            "square": "32.4",
            "name": "Аудиторія",
            "room": "410"
        },
        {
            "square": "32",
            "name": "Аудиторія",
            "room": "411"
        },
        {
            "square": "32",
            "name": "Аудиторія",
            "room": "412"
        },
        {
            "square": "48.3",
            "name": "Ресурсний центр",
            "room": "413"
        },
        {
            "square": "29.8",
            "name": "Фонетична лабораторія",
            "room": "414"
        },
        {
            "square": "69.5",
            "name": "Деканат",
            "room": "415"
        },
        {
            "square": "14.1",
            "name": "Кабінет заступника декана",
            "room": "415а"
        },
        {
            "square": "42",
            "name": "Методичний кабінет",
            "room": "416"
        },
        {
            "square": "18.9",
            "name": "Кабінет асоціації викладачів німецької мови",
            "room": "417"
        },
        {
            "square": "19.3",
            "name": "Аудиторія",
            "room": "418"
        },
        {
            "square": "13.1",
            "name": "Аудиторія",
            "room": "419"
        },
        {
            "square": "34.3",
            "name": "Аудиторія",
            "room": "420"
        },
        {
            "square": "16",
            "name": "Аудиторія",
            "room": "421"
        },
        {
            "square": "35.4",
            "name": "Аудиторія",
            "room": "422"
        },
        {
            "square": "13",
            "name": "Аудиторія",
            "room": "423"
        },
        {
            "square": "16.2",
            "name": "Аудиторія",
            "room": "424"
        },
        {
            "square": "33.3",
            "name": "Аудиторія",
            "room": "425"
        },
        {
            "square": "12.8",
            "name": "Аудиторія",
            "room": "426"
        },
        {
            "square": "63",
            "name": "Кафедра німецької філології",
            "room": "427"
        },
        {
            "square": "4.7",
            "name": "Редакція журналу «іноземна філологія»",
            "room": "428"
        },
        {
            "square": "10.8",
            "name": "Аудиторія",
            "room": "429"
        },
        {
            "square": "43.5",
            "name": "Кафедра французької філології",
            "room": "430"
        },
        {
            "square": "28.1",
            "name": "Кафедра світової літератури",
            "room": "431"
        },
        {
            "square": "27.5",
            "name": "Аудиторія",
            "room": "432"
        },
        {
            "square": "72.2",
            "name": "Аудиторія",
            "room": "433"
        },
        {
            "square": "69.4",
            "name": "Аудиторія",
            "room": "434"
        },
        {
            "square": "14.6",
            "name": "Кафедра англійської філології",
            "room": "435"
        },
        {
            "square": "14.7",
            "name": "Кафедра англійської філології",
            "room": "435а"
        },
        {
            "square": "14.7",
            "name": "Кабінет завідувача кафедри англійської філології",
            "room": "435б"
        },
        {
            "square": "12.2",
            "name": "Кафедра класичної філології",
            "room": "436"
        },
        {
            "square": "14.3",
            "name": "Кафедра класичної філології",
            "room": "436а"
        },
        {
            "square": "48",
            "name": "Аудиторія",
            "room": "055"
        }

    ],

    filo: [
        {
            "square": "93.2",
            "name": "Комп’ютерний клас",
            "room": "121"
        },
        {
            "square": "26.9",
            "name": "Аудиторія",
            "room": "121а"
        },
        {
            "square": "32",
            "name": "Аудиторія",
            "room": "121б"
        },
        {
            "square": "18.7",
            "name": "Аудиторія",
            "room": "121г"
        },
        {
            "square": "14.5",
            "name": "Аудиторія",
            "room": "121д"
        },
        {
            "square": "20.2",
            "name": "Інститут літературознавчий студій",
            "room": "122"
        },
        {
            "square": "26.1",
            "name": "Кафедра російської філології",
            "room": "226"
        },
        {
            "square": "25.3",
            "name": "Ау диторія",
            "room": "226а"
        },
        {
            "square": "52.8",
            "name": "Аудиторія",
            "room": "226б"
        },
        {
            "square": "21.1",
            "name": "Аудиторія",
            "room": "230"
        },
        {
            "square": "95.1",
            "name": "Аудиторія",
            "room": "231"
        },
        {
            "square": "72.7",
            "name": "Деканат",
            "room": "232"
        },
        {
            "square": "49.9",
            "name": "Кафедра українського прикладного мовознавства",
            "room": "233"
        },
        {
            "square": "23.7",
            "name": "Кафедра української мови",
            "room": "234"
        },
        {
            "square": "63.4",
            "name": "Кафедра української мови",
            "room": "235"
        },
        {
            "square": "42",
            "name": "Кафедра сходознавства",
            "room": "239"
        },
        {
            "square": "40.6",
            "name": "Кафедра теорії літератури та порівняльного літературознавства",
            "room": "245"
        },
        {
            "square": "98.4",
            "name": "Інститут франкознавства",
            "room": "305"
        },
        {
            "square": "91.5",
            "name": "Аудиторія",
            "room": "308"
        },
        {
            "square": "40",
            "name": "Кафедра української літератури",
            "room": "309"
        },
        {
            "square": "70.3",
            "name": "Кафедра української літератури",
            "room": "310"
        },
        {
            "square": "241",
            "name": "Аудиторія",
            "room": "311"
        },
        {
            "square": "7.4",
            "name": "Редакція",
            "room": "311а"
        },
        {
            "square": "176",
            "name": "Конференційна зала",
            "room": "312"
        },
        {
            "square": "60.1",
            "name": "Аудиторія",
            "room": "312а"
        },
        {
            "square": "13.5",
            "name": "Бібліотека факультету",
            "room": "312б"
        },
        {
            "square": "26.4",
            "name": "Аудиторія",
            "room": "324"
        },
        {
            "square": "40.5",
            "name": "Аудиторія",
            "room": "324а"
        },
        {
            "square": "30",
            "name": "Кабінет завідувача кафедри словянської філології",
            "room": "324б"
        },
        {
            "square": "32.2",
            "name": "Викладацька",
            "room": "324в"
        },
        {
            "square": "31.1",
            "name": "Аудиторія",
            "room": "325"
        },
        {
            "square": "32.5",
            "name": "Комп’ютерний клас",
            "room": "326"
        },
        {
            "square": "16.8",
            "name": "Бібліотека факультету",
            "room": "326б"
        },
        {
            "square": "49",
            "name": "Кафедра польської філології",
            "room": "327"
        },
        {
            "square": "51.3",
            "name": "Аудиторія",
            "room": "330"
        },
        {
            "square": "43",
            "name": "Кафедра загального мовознавства",
            "room": "343"
        },
        {
            "square": "28.6",
            "name": "Аудиторія",
            "room": "345"
        },
        {
            "square": "30",
            "name": "Кафедра української фолькльористики",
            "room": "345а"
        },
        {
            "square": "29",
            "name": "Завідувач кафедри української фолькльористики",
            "room": "345б"
        },
        {
            "square": "29.3",
            "name": "Бібліотека діаспорних видань імені Петра Гоя",
            "room": "349"
        }

    ],

    filosof: [
        {
            "square": "29.1",
            "name": "Службове приміщення",
            "room": "79"
        },
        {
            "square": "24.4",
            "name": "Службове приміщення",
            "room": "80"
        },
        {
            "square": "74.9",
            "name": "Аудиторія імені Героя України  Сергія Кемського",
            "room": "201"
        },
        {
            "square": "47.2",
            "name": "Кабінет мистецтвознавства",
            "room": "202"
        },
        {
            "square": "23.9",
            "name": "Завідувач кафедри історії політичних вчень",
            "room": "203"
        },
        {
            "square": "23.9",
            "name": "Кафедра історії політичних вчень",
            "room": "204"
        },
        {
            "square": "47.3",
            "name": "Навчально-методичний кабінет філософії",
            "room": "205"
        },
        {
            "square": "23.9",
            "name": "Кафедра політології",
            "room": "206"
        },
        {
            "square": "23.6",
            "name": "Завідувач кафедри політології",
            "room": "207"
        },
        {
            "square": "12.5",
            "name": "спеціалізованої вчена рада",
            "room": "208а"
        },
        {
            "square": "93.2",
            "name": "Аудиторія",
            "room": "220"
        },
        {
            "square": "20.2",
            "name": "Службове приміщення",
            "room": "300"
        },
        {
            "square": "76.5",
            "name": "Аудиторія",
            "room": "301"
        },
        {
            "square": "47",
            "name": "Деканат філософського факультету",
            "room": "302"
        },
        {
            "square": "12.2",
            "name": "Спеціалізована  вчена рада",
            "room": "302а"
        },
        {
            "square": "50.6",
            "name": "Кафедра історії філософії",
            "room": "303"
        },
        {
            "square": "9.5",
            "name": "Деканат заочного відділення",
            "room": "306"
        },
        {
            "square": "19.2",
            "name": "Деканат денного відділення",
            "room": "306а"
        },
        {
            "square": "27.9",
            "name": "Кафедра філософії",
            "room": "315"
        },
        {
            "square": "27.6",
            "name": "Кафедра філософії",
            "room": "316"
        },
        {
            "square": "39.5",
            "name": "Аудиторія",
            "room": "340"
        },
        {
            "square": "47.2",
            "name": "Аудиторія",
            "room": "341"
        },
        {
            "square": "25",
            "name": "Центр політичних досліджень філософського факультету",
            "room": "348а"
        },
        {
            "square": "25.1",
            "name": "Кафедра теорії та історії культури",
            "room": "356"
        },
        {
            "square": "20.1",
            "name": "Кафедра теорії та історії культури",
            "room": "357"
        },
        {
            "square": "12.5",
            "name": "Завідувач кафедри теорії та історії культури",
            "room": "358"
        },
        {
            "square": "36",
            "name": "Лабораторія етики та естетики",
            "room": "359"
        },
        {
            "square": "4.4",
            "name": "Службове приміщення",
            "room": "359а"
        },
        {
            "square": "21.4",
            "name": "Аудиторія",
            "room": "362"
        }

    ],

    reporter: [
        {
            "square": "90.8",
            "name": "Аудиторія",
            "room": "350"
        },
        {
            "square": "24.2",
            "name": "Аудиторія",
            "room": "351"
        }
    ],

    istor: [
        {
            "square": "85.5",
            "name": "Аудиторія",
            "room": "307"
        },
        {
            "square": "102.4",
            "name": "Аудиторія",
            "room": "313"
        },
        {
            "square": "63.6",
            "name": "Аудиторія",
            "room": "314"
        },
        {
            "square": "60.3",
            "name": "Кафедра історії центральної та східної Європи",
            "room": "317"
        },
        {
            "square": "30.3",
            "name": "Кафедра історії та теорії соціології",
            "room": "318"
        },
        {
            "square": "43.9",
            "name": "Лабораторія соціологічних досліджень",
            "room": "319"
        },
        {
            "square": "19.6",
            "name": "Кафедра історії та теорії соціології",
            "room": "320"
        },
        {
            "square": "51.1",
            "name": "Кафедра історії середніх віків та візантивістики",
            "room": "321"
        },
        {
            "square": "49.4",
            "name": "Кафедра етнології",
            "room": "322"
        },
        {
            "square": "33.2",
            "name": "Аудиторія",
            "room": "323"
        },
        {
            "square": "78.9",
            "name": "Деканат",
            "room": "329"
        },
        {
            "square": "51.3",
            "name": "Навчально-методична лабораторія історичного факультету",
            "room": "330"
        },
        {
            "square": "24.4",
            "name": "Кафедра історичного краєзнавства",
            "room": "331"
        },
        {
            "square": "24.4",
            "name": "Аудиторія",
            "room": "332"
        },
        {
            "square": "42",
            "name": "Кафедра новітньої історії України",
            "room": "333"
        },
        {
            "square": "46.9",
            "name": "Аудиторія",
            "room": "334"
        },
        {
            "square": "64.1",
            "name": "Кафедра нової та новітньої історії зарубіжних країн",
            "room": "334а"
        },
        {
            "square": "73",
            "name": "Аудиторія",
            "room": "336"
        },
        {
            "square": "180.3",
            "name": "Археологічний музей",
            "room": "337"
        },
        {
            "square": "31.3",
            "name": "Кафедра давньої історії України та архівознавства",
            "room": "338"
        },
        {
            "square": "18",
            "name": "Кафедра археології та соціальних галузей історичної науки стародавнього світу",
            "room": "342"
        }

    ]

};

module.exports = rooms;